# Capstone Two: Exploratory Data Analysis

In [2]:
# import libiraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [11]:
# loading clean data
df = pd.read_csv('data/cleanData.csv')
df.head()

,userId,productId,userRating,productName,productRating,noOfRatings,price
0,1,44,2.1,"Samsung Galaxy M04 Light Green, 4GB RAM, 64GB ...",4.0,703,147.160
1,1,30,2.1,Hammer Ace 3.0 Bluetooth Calling Smart Watch w...,3.9,844,61.308
2,1,50,1.6,"Redmi 10A (Slate Grey, 4GB RAM, 64GB Storage) ...",4.0,254,147.160
3,1,4,4.6,"Samsung Galaxy M33 5G (Mystique Green, 6GB, 12...",4.1,701,306.592
4,1,3,2.0,OnePlus Bullets Z2 Bluetooth Wireless in Ear E...,4.2,54,28.197